<?php
/**
 *
 * Browser and Mobile Notifications. An extension for the phpBB Forum Software package.
 *
 * @copyright (c) 2019, Jakub Senko
 * @license Proprietary/All rights reserved
 * @licensee {{LICENSEE}}
 *
 */

if (!defined('IN_PHPBB'))
{
	exit;
}

if (empty($lang) || !is_array($lang))
{
	$lang = array();
}

$lang = array_merge($lang, array(
	'ACP_SENKY_PUSHNOTIFICATIONS_CAT' 		=> 'إشعارات المتصفح والجوال',
	'ACP_SENKY_PUSHNOTIFICATIONS_SETTINGS'	=> 'الإعدادات',
	'ACP_SENKY_PUSHNOTIFICATIONS_TITLE'		=> 'إعدادات إشعارات المتصفح والجوال',
	'SENKY_PUSHNOTIFICATIONS_ENABLED_USERS'	=> [
		1	=> 'منتداك لديه <strong>%d</strong> مستخدم فعل إشعارات المتصفح من اصل %d (%0.2f%%).',
		2	=> 'منتداك لديه <strong>%d</strong> مستخدم فعلوا إشعارات المتصفح من اصل %d (%0.2f%%).',
	],

	'DISPLAY_POPUP'			=> 'عرض نافذة منبثقة',
	'DISPLAY_POPUP_EXPLAIN'	=> 'اضبط على نعم لعرض نافذة منبثقة للمستخدمين بعد تسجيل دخولهم تطالبهم بتفعيل إشعارات المتصفح. سيكون بإمكانهم رفض وإخفاء النافذة المنبثقة. من ناحية أخرى، قد تبدو هذه الطريقة مخيفة بعض الشيء لبعض المستخدمين وقد يرفضون إلاشعارات بسبب خوف لحظي مؤقت. وبالتالي يجب استخدام هذه الطريقة بحذر.<br><br>&raquo; <a id="pop-up-alternatives-btn" href="#">رؤية اقنراحات بديلة</a>',

	'POP_UP_ALTERNATIVES_HEADER'		=> 'كيفية تشجيع المستخدمين على تفعيل إشعارات المتصفح',
	'POP_UP_ALTENRATIVES_P1'			=> 'إن جعل المستخدمين ينقرون على تلك النافذة المنبثقة الغريبة للمتصفح ليست مهمة سهلة. نتج عن العديد من اختبارات قابلية الاستخدام التي تناولت هذا السيناريو نفس التوصية: لا تطلب أبداً إذن المستخدمين قبل أن يتمكنوا من رؤية ميزة ذلك بوضوح. لهذا السبب تقدم هذه الإضافة إشعاراً للمتصفح في الأماكن التي يتعامل فيها المستخدم مع إشعارات المنتدى.',
	'POP_UP_ALTENRATIVES_P2'			=> 'ولكن من المفهوم بوضوح أنك تريد أن يستفيد المستخدمون من هذه الميزة الرائعة. لذا، إليك بعض الطرق الموصى بها للقيام بذلك بطريقة غير عدوانية:',
	'POP_UP_ALTENRATIVES_L1_HEADER'		=> 'نشر إعلان',
	'POP_UP_ALTENRATIVES_L1_CONTENT'	=> 'إذا كنت تعلم أن المستخدمين يقرؤون الإعلانات بانتظام، فما عليك سوى نشر إعلان جديد لإعلامهم بإشعارات المتصفح وما هي مزاياه وكيفية تفعيلهم.',
	'POP_UP_ALTENRATIVES_L2_HEADER'		=> 'إرسال رسالة خاصة للجميع',
	'POP_UP_ALTENRATIVES_L2_CONTENT'	=> 'ليس هناك ما هو أكثر خصوصية في phpBB من رسالة خاصة. لن تختبئ من نظر المستخدم بسبب ذلك العدد المتوهج للرسائل الغير مقروءة أعلى الصفحة. ويستحق المستخدمون لديك رسالة إيجابية من المدير ولو مرة واحدة، أليس كذلك؟',
	'POP_UP_ALTENRATIVES_L3_HEADER'		=> 'استخدم اضافة Board Announcements',
	'POP_UP_ALTENRATIVES_L3_CONTENT'	=> '<a target="_blank" href="https://www.phpbb.com/customise/db/extension/boardannouncements/">Board
											Announcements</a> هي اضافة رسمية رائعة تمكّنك من عرض رسالة في كل صفحة من صفحات المنتدى. مع هذه الاضافة وبعض الكلمات المشجعة منك ستكفي لرفع معدل استخدام اشعارات المتصفح.',
	'POP_UP_ALTENRATIVES_L4_HEADER'		=> 'إرسال إشعارات جماعية',
	'POP_UP_ALTENRATIVES_L4_CONTENT'	=> 'لم تسمع بمثل هذا الخيار من قبل؟ إضافتي الجديدة
											<a target="_blank" href="https://www.phpbb.com/customise/db/extension/massnotification/">Mass
											notification</a> تسمح لك بإرسال إشعار جماعي لمرة واحدة. لذا، بينما يقرأ المستخدمون الإشعار الخاص بك، قد يضغطون على زر "تفعيل" أدناه.',
	'POP_UP_ALTENRATIVES_P3'			=> 'لا تزال غير واثق؟ إذا لم تساعدك الاقتراحات الواردة أعلاه، فقد تفكر في استخدام خيار النافذة المنبثقة لتعقب المستخدمين الباقين. لن يتم عرض النافذة المنبثقة للمستخدمين الذين قاموا بالفعل بتفعيل الإشعارات أو تعطيلها، لذلك لا تقلق بشأن المستخدمين الذين حددوا خيارهم بالفعل.',
	'CLOSE'								=> 'إغلاق',

	'POPUP_METHOD'					=> 'طريقة عرض النافذة المنبثقة',
	'POPUP_METHOD_EXPLAIN'			=> 'نظرًا لأنك قررت عرض نافذة منبثقة لتشجيع المستخدمين على السماح بإشعارات المتصفح، هناك خياران بشأن كيفية عرضها. الخيار الأول أقل تغلغلاً ويمنح المستخدم أيضاً فرصة لفهم مزايا تمكين إشعارات المتصفح. الخيار الثاني أقل تدخلاً، ولكنه قد يؤدي إلى العديد من حالات الرفض.',
	'POPUP_METHOD_ONLY_PROMPT'		=> '<strong>عرض موجه المتصفح مباشرة.</strong> سيرى المستخدمون موجه المتصفح مباشرةً في جميع الصفحات التي يزورونها حتى يؤكدوا أو يرفضوا إشعارات المتصفح.',
	'POPUP_METHOD_ASK_AFTER_LOGIN'	=> '<strong>السؤال مرة واحدة بعد كل تسجيل الدخول.</strong> سيتم سؤال المستخدمين مرة واحدة في كل مرة يسجلون فيها ما إذا كانوا يرغبون في تلقي إشعارات المتصفح. في حال التأكيد، سيرون موجه المتصفح. في حال الرفض، لن يروا تلك النافذة المنبثقة مرة أخرى.',

	'SETTINGS_SAVED'	=> 'تم حفظ إعدادات إشعارات المتصفح والجوال',

	// Mass notification extension
	'NOTIFICATION_METHOD' 			=> 'طريقة الإشعار',
	'NOTIFICATION_METHOD_EXPLAIN'	=> 'يمكنك اختيار إرسال إشعار عبر إضافة إشعارات المتصفح والجوال بدلاً من طريقة الإشعار التقليدية للمنتدى.',
	'USE_BOARD_NOTIFICATIONS'		=> 'استخدام إشعارات المنتدى',
	'USE_BROWSER_NOTIFICATIONS'		=> 'استخدام إشعارات المتصفح',
));
